In [1]:
import pandas as pd
# data viz lib
import numpy as np

In [2]:
import os
os.getcwd()

'C:\\Users\\Animesh.Parikshya'

In [3]:
os.chdir('C:/Users/Animesh.Parikshya/Documents/IIM Classes/Data sets')

In [8]:
data = pd.read_csv('retailmcq.csv')

In [9]:
data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [12]:
	data['Item_Weight'].map(lambda x: "low" if x < 8 else "mdwt" if 8 < x < 16 else "highwt")

0         mdwt
1          low
2       highwt
3       highwt
4         mdwt
         ...
8518       low
8519      mdwt
8520      mdwt
8521       low
8522      mdwt
Name: Item_Weight, Length: 8523, dtype: object

In [13]:
type(data.Outlet_Type)

pandas.core.series.Series

In [14]:
data.isnull().sum()

Item_Identifier                 0
Item_Weight                  1463
Item_Fat_Content                0
Item_Visibility                 0
Item_Type                       0
Item_MRP                        0
Outlet_Identifier               0
Outlet_Establishment_Year       0
Outlet_Size                  2410
Outlet_Location_Type            0
Outlet_Type                     0
Item_Outlet_Sales               0
dtype: int64

In [17]:
data[(data["Outlet_Type"]=="Grocery Store") & (data["Outlet_Size"]=="Small") & (data["Item_Fat_Content"]=="Low Fat")].shape[0]

314

In [18]:
pd.Timestamp('15-06-18')+pd.to_timedelta(365,unit='D')

Timestamp('2019-06-15 00:00:00')

In [19]:

	data.describe()

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales
count,7060.000000,8523.000000,8523.000000,8523.000000,8523.000000
mean,12.857645,0.066132,140.992782,1997.831867,2181.288914
std,4.643456,0.051598,62.275067,8.371760,1706.499616
min,4.555000,0.000000,31.290000,1985.000000,33.290000
25%,8.773750,0.026989,93.826500,1987.000000,834.247400
50%,12.600000,0.053931,143.012800,1999.000000,1794.331000
75%,16.850000,0.094585,185.643700,2004.000000,3101.296400
max,21.350000,0.328391,266.888400,2009.000000,13086.964800

In [20]:

	data.groupby(['Outlet_Type','Outlet_Size'], as_index= False).agg({'Item_MRP': np.mean})

         Outlet_Type Outlet_Size    Item_MRP
0      Grocery Store       Small  139.787088
1  Supermarket Type1        High  141.425982
2  Supermarket Type1      Medium  140.297699
3  Supermarket Type1       Small  142.589934
4  Supermarket Type2      Medium  141.678634
5  Supermarket Type3      Medium  139.801791

In [21]:

	data.groupby('Outlet_Type', as_index=False)['Item_Outlet_Sales'].max.sort_values("Item_Outlet_Sales",ascending=False)

AttributeError: 'function' object has no attribute 'sort_values'

In [22]:

	print(data.columns.tolist())

['Item_Identifier', 'Item_Weight', 'Item_Fat_Content', 'Item_Visibility', 'Item_Type', 'Item_MRP', 'Outlet_Identifier', 'Outlet_Establishment_Year', 'Outlet_Size', 'Outlet_Location_Type', 'Outlet_Type', 'Item_Outlet_Sales']

In [6]:
df.isnull().sum()

first_name      0
last_name       0
company_name    0
address         0
city            0
county          0
postal          0
phone1          0
phone2          0
email           0
web             0
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    500 non-null    object
 1   last_name     500 non-null    object
 2   company_name  500 non-null    object
 3   address       500 non-null    object
 4   city          500 non-null    object
 5   county        500 non-null    object
 6   postal        500 non-null    object
 7   phone1        500 non-null    object
 8   phone2        500 non-null    object
 9   email         500 non-null    object
 10  web           500 non-null    object
dtypes: object(11)
memory usage: 43.1+ KB

In [14]:
import pandas as pd
from pandas import Series,DataFrame

In [15]:
data={lat:[19,22,13,54,65],long:[60,75,58,85,79]}

NameError: name 'lat' is not defined

In [16]:
l1=[{'lat': 19, 'long':60},{ 'lat': 22, 'long':75}] 

data={'lat':[19,22,13,54,65],'long':[60,75,58,85,79]}

In [44]:
data={'lat': Series([19,22,13,54,65]),'long':Series([60,75,58,85,79])} 
data

{'lat': 0    19
 1    22
 2    13
 3    54
 4    65
 dtype: int64,
 'long': 0    60
 1    75
 2    58
 3    85
 4    79
 dtype: int64}

In [23]:
np.log(5)

1.6094379124341003

In [19]:
log(5)

NameError: name 'log' is not defined

In [24]:
pd.log(5)

AttributeError: module 'pandas' has no attribute 'log'

In [21]:
Series.log(5)

AttributeError: type object 'Series' has no attribute 'log'

In [26]:
df.loc[df['email'].str.endswith("gmail.com") & (df['first_name'] == 'Antonio')]

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
272,Antonio,Villamarin,Combs Sheetmetal,353 Standish St #8264,Little Parndon and Hare Street,Hertfordshire,CM20 2HT,01559-403415,01388-777812,antonio.villamarin@gmail.com,http://www.combssheetmetal.co.uk
427,Antonio,Heilig,Radisson Suite Hotel,35 Elton St #3,Ipplepen,Devon,TQ12 5LL,01324-171614,01442-946357,antonio.heilig@gmail.com,http://www.radissonsuitehotel.co.uk

In [27]:
import random
l1 = []
for x in range(5):
    l1.append(random.randint(1,25000))
    print (l1)

[15308]
[15308, 16341]
[15308, 16341, 5590]
[15308, 16341, 5590, 3027]
[15308, 16341, 5590, 3027, 15904]

In [32]:
l2 = map(lambda x:x*5,l1)
print(list(l2))

[76540, 81705, 27950, 15135, 79520]

In [29]:
Series(l1) * 5

0    76540
1    81705
2    27950
3    15135
4    79520
dtype: int64

In [35]:
names_new = df[['city']]

names_new

                               city
0                 St. Stephens Ward
1                        Abbey Ward
2    East Southbourne and Tuckton W
3                Hawerby cum Beesby
4        Greets Green and Lyng Ward
..                              ...
495  Knightsbridge and Belgravia Wa
496        Inverness Ness-Side Ward
497                Darton West Ward
498                Consett North ED
499               Tanworth-in-Arden

[500 rows x 1 columns]

In [37]:
names_new = df.City

names_new

AttributeError: 'DataFrame' object has no attribute 'City'

In [38]:
names = ['Buick', 'Cadillac', 'Chevrolet', 'Pontiac', 'Saturn', 'SAAB']
ds = [False, False,False, True, True, False]
pr = [20815, 40936, 16428, 18412, 13979, 29495]

In [42]:
my_dict = {'Make':names, 'Discontinued':ds, 'Price':pr }
my_dict
type(my_dict)

dict